#include "init.h"










void Timer1Init()		//1毫秒@12.000MHz
{
	AUXR |= 0x40;		//定时器时钟1T模式
	TMOD &= 0x0F;		//设置定时器模式
	TL1 = 0x20;		//设置定时初始值
	TH1 = 0xD1;		//设置定时初始值
	TF1 = 0;		//清除TF1标志
	TR1 = 1;		//定时器1开始计时
	
	ET1 = 1;		//定时器1中断允许
	EA = 1;			//总中断允许
}



void LedBuzzInit()	//初始化LED和蜂鸣器等外设,防止上电时出现异常
{
	HC138Set(4);	//138译码器选择LED对应的锁存器,使P0口输出直接控制LED
	P0 = 0xFF;		//LED全灭
	HC138Set(5);	//138译码器选择BUZZ对应的锁存器,使P0口输出直接控制BUZZ和继电器
	BUZZ = 0;		//蜂鸣器关闭
	RELAY = 0;		//继电器关闭
	HC138Set(0);	//138译码器悬空,避免影响其他功能
}


void HC138Set(unsigned char Y)	//设置138译码器的Y0~Y7
{
	P2 &= 0x1F;		//清除P2口的高3位
	P2 |= (Y & 0x07) << 5;	//设置P2口的高3位,将Y对应的十进制数转换为高三位对应的Y0~Y7口，如Y=4,则P2口的高3位为100,即选通Y4C
}














